Sandgreenpanda/2026-ESP32/src/main.cpp
    Serial.println(user_password_trimmed);
    Serial.println(PASSWORD);

    if (user_password_trimmed == PASSWORD || req_str == "/style.css" || req_str == "/admin" || req_str == "/update") {
        if (user_password_trimmed == PASSWORD && req_str == "/admin") {
            res->setHeader("Content-Type", "text/html");
            res->println(FuncReadTemplate("/templates/log_out.html", {{"%LOGGED_IN%", "logout"}}));
        } else {
            next();
        }
    } else {
        res->setStatusCode(404);
        res->setHeader("Content-Type", "text/html");
        res->println(FuncReadTemplate("/templates/admin.html", {{"%LOGGED_IN%", "login"}, {"%ERROR%", "You need to log in to access this page"}}));
    }
}

void handleRoot(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/home.html", {{"%LOGGED_IN%", "logout"}, {"%TIME%", (String)((int)(millis() / 1000))}}));
}

void handleStyle(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/css");
    res->setHeader("Connection", "close");
    res->println(SD.open("/static/style.css", FILE_READ).readString());
};

void handleTerminal(HTTPRequest *req, HTTPResponse *res) {
    // Status code is 200 OK by default.
    // We want to deliver a simple HTML page, so we send a corresponding content type:
    res->setHeader("Connection", "close");
    res->setHeader("Content-Type", "text/html");

    res->println(FuncReadTemplate("/templates/terminal.html", {{"%LOGGED_IN%", "logout"}}));
};

void handleComputers(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/html");
    res->println(FuncReadTemplate("/templates/computers.html", {{"%LOGGED_IN%", "logout"}}));
};

WebsocketHandler *SSHHandler::create() {
    Serial.println("Creating new chat client!");
    SSHHandler *handler = new SSHHandler();
    if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClients[i] == nullptr) {
                activeClients[i] = handler;
                break;
            }
        }
        xSemaphoreGive(clientsMutex);
    } else {
        Serial.println("Unable to take variable lock");
    }
    return handler;
}

// When the websocket is closing, we remove the client from the array
void SSHHandler::onClose() {
    if (clientsMutex != NULL && xSemaphoreTake(clientsMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < MAX_CLIENTS; i++) {
            if (activeClients[i] == this) {
                activeClients[i] = nullptr;
            }
        }
        xSemaphoreGive(clientsMutex);
    } else {
        Serial.println("Unable to take variable lock");
    }
}

void SSHHandler::onMessage(WebsocketInputStreambuf *inbuf) {
    // Get the input message
    // Dont know how this works, but I got it from the default websocket chat example
    // Might figure it out later
    std::ostringstream ss;
    std::string msg;
    ss << inbuf;
    msg = ss.str();
    String ssh_msg = msg.c_str();

    // Send the ssh output to the client

    Serial.println(ssh_msg);
    ssh_command = ssh_msg;

    /*
    this->send(shh_output_string.c_str(), SEND_TYPE_TEXT);
    shh_output_string = "";

    HERE:
    void SSHHandler::onMessage(WebsocketInputStreambuf *inbuf) {
    if (inbuf == nullptr) return;

    // 1. Properly read the streaming characters out of the input buffer
    std::string msg;
    int ch;
    while ((ch = inbuf->sbumpc()) != EOF) {
        msg.push_back(static_cast<char>(ch));
    }

    // 2. Convert it safely to an Arduino String (it automatically null-terminates)
    String ssh_msg = String(msg.c_str());

    // 3. Print and assign
    Serial.println("ssh cmd received:");
    Serial.println(ssh_msg);

    ssh_command = ssh_msg;

    Serial.println("ssh command processing finished");
}


    */
}

void handleTerminalUpdate(HTTPRequest *req, HTTPResponse *res) {
    // sse headers

    //  res->setChunkedTransferMode();
    res->setHeader("Content-Type", "text/event-stream");
    res->setHeader("Cache-Control", "no-cache");
    res->setHeader("Connection", "keep-alive");

    // This code adds res to the list of clients that get sse updates
    res->print(""); // Force submit the headers

    // int rawSocketFd = req->getClientStartData()->_socket;
    sseClients.push_back(res); // res is a pointer.

    // res->Save(); // Pointers no longer disappear
    //  Allows for SSE

    // A client is removed upon a bad res->print in the ssh loop

    // res->flush();

    // This code was bad and blocked the whole thread
    /*
    while (1) {
        if (shh_output_send != "") {
            // res->write((uint8_t *)shh_output_send.c_str(), shh_output_send.length());
            res->print(shh_output_send);
            shh_output_send = "";
        }
        delay(10); // Let the esp complete other tasks in this thread
    }
    */
}

void handleTerminalPost(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/plain");

    // Stream the incoming request body to the response body
    // Theoretically, this should work for every request size.
    byte buffer[256];
    // HTTPReqeust::requestComplete can be used to check whether the
    // body has been parsed completely.
    String shh_input_string = "";
    while (!(req->requestComplete())) {
        // HTTPRequest::readBytes provides access to the request body.
        // It requires a buffer, the max buffer length and it will return
        // the amount of bytes that have been written to the buffer.
        size_t s = req->readBytes(buffer, 256);

        // The response does not only implement the Print interface to
        // write character data to the response but also the write function
        // to write binary data to the response.
        shh_input_string += String(buffer, s);
        // res->write(buffer, s);
    }
    Serial.println(shh_input_string);
    ssh_command = shh_input_string.substring(1, shh_input_string.length() - 1);
    while (ssh_command != "") {
        delay(1);
    }
    res->println(shh_output_string);
    shh_output_string = "";
}

void handleFan(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "text/plain");
    byte buffer[256];

    String fanSpeedInput = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        fanSpeedInput += String(buffer, s);
    }
    ledcWrite(0, fanSpeedInput.substring(1, fanSpeedInput.length() - 1).toInt());
    // ledcWrite(0, fanSpeedInput.substring(6).toInt()); // Substring cuts off: speed=
    // Serial.println(fanSpeedInput.substring(6).toInt());
}

void handleSCP(HTTPRequest *req, HTTPResponse *res) {
    res->setHeader("Content-Type", "application/octet-stream");

    byte buffer[256];

    String filepath = "";
    while (!(req->requestComplete())) {
        size_t s = req->readBytes(buffer, 256);
        filepath += String(buffer, s);
    }
    fp_encoded.urlcode = filepath;
    fp_encoded.urldecode();
    String fp = fp_encoded.strcode;
    scp_command = fp.substring(9, filepath.length());
    Serial.println(scp_command);

    while (scp_command != "") {
        delay(1);
    }

